[Ability_academie.A_heals_magique H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法恢复"
mTooltip="秘密能力：如果英雄拥有20点或更多 %icon_magic 魔力：此生物获得 %spell2.name，治疗所有友方魔法型生物 %d %icon_health 生命值。"

[Ability_academie.A_heals_magique_Buffhero H7BaseBuff]
mName="复活"
mTooltip=""

[Ability_academie.A_Resurection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="魔法恢复"
mTooltip="治疗所有友方魔法生物 %d %icon_health 生命值。"

[Ability_necropole.A_necromante_Buffhero H7BaseBuff]
mName=""
mTooltip=""

[Ability_necropole.A_Necromante_marker_secret H7BaseBuff]
mName="德鲁伊射击"
mTooltip=""

[Ability_necropole.A_necromante_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Ability_necropole.A_Surnatural_Buff H7BaseBuff]
mName="吸血鬼不朽"
mTooltip="当此生物首次死亡时，它会以相当于初始队伍 %special 的队伍数量复活。"

[Ability_necropole.A_Surnaturel_Instinct H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="超自然本能"
mTooltip="此生物无法被侧击。\n秘密能力：如果英雄拥有超过20点 %icon_defense 防御，此生物获得 %spell1.name。"

[Ability_necropole.A_vamp_surnatural_Buffhero H7BaseBuff]
mName=""
mTooltip=""

[Ability_Stronghold.A_Revigorance_buff H7BaseBuff]
mName="复苏"
mTooltip="当生物攻击时，它治疗自身和相邻的友方生物 %d1 %icon_health 生命值。"

[Ability_Stronghold.A_Wyvern_Buffhero H7BaseBuff]
mName="复活"
mTooltip=""

[Ability_Stronghold.A_Wyvern_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="复苏"
mTooltip="秘密能力：当英雄拥有20点或更多 %icon_attack 力量时，此生物获得 %spell1.name。"

[Ability_sylvan.A_druide_shoot_Buffhero H7BaseBuff]
mName="jjjjjj"
mTooltip=""

[Ability_sylvan.A_druide_shoot_Buffhero2 H7BaseBuff]
mName="德鲁伊射击"
mTooltip=""

[Ability_sylvan.A_druide_shoot_Buffhero3 H7BaseBuff]
mName="生命值"
mTooltip=""

[Ability_sylvan.A_druide_shoot_healthbuff H7BaseBuff]
mName=""
mTooltip=""

[Ability_sylvan.A_druide_shoot_manaBuffhero H7BaseBuff]
mName="德鲁伊射击"
mTooltip=""

[Ability_sylvan.A_druide_shoot_manaBuffhero_marker H7BaseBuff]
mName="德鲁伊射击"
mTooltip=""

[Ability_sylvan.A_druide_shoot_marker H7BaseBuff]
mName="标记"
mTooltip=""

[Ability_sylvan.A_instinct_shoot_Buffhero H7BaseBuff]
mName="本能射击"
mTooltip=""

[Ability_sylvan.A_LeafDaggers H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="强化叶刃"
mTooltip="该生物可以 %ICON_RANGE 全射程对一条直线上的所有敌方单位射击。此射击忽略 %ICON_DEFENSE 防御和掩护。\n每次射击消耗20点 %icon_mana 法力。\n如果英雄在战斗回合结束时拥有少于20点 %icon_mana 法力，则无法使用 %spell1.name。"

[Ability_Stronghold.A_Rock_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="巨鹏光环"
mTooltip="秘密能力：当英雄拥有20点或更多 %icon_spirit 精神时：\n此生物获得 %stat %icon_health 生命值加成和 %spell1.name 能力，该能力使战场上所有你的单位所受 %icon_magic 魔法伤害减少 %res。"

[Ability_Stronghold.A_Rock_Buffhero H7BaseBuff]
mName="巨鹏光环"
mTooltip=""

[Ability_Stronghold.A_protection_Mbuff H7BaseBuff]
mName="巨鹏光环"
mTooltip="所有友方生物承受来自 %icon_magic 魔法生物的伤害减少 %res。"

[Ability_academie.A_frappe_raksha H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName=""
mTooltip=""

[Ability_academie.A_hero_att_Buffmarker H7BaseBuff]
mName=""
mTooltip=""

[Ability_academie.A_Rakashassa_Buffhero H7BaseBuff]
mName=""
mTooltip=""

[Ability_academie.A_Rakashassa_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="英雄支援"
mTooltip="秘密能力：当英雄拥有20点或更多 %icon_attack 攻击时：\n此生物攻击与英雄相同的目标，前提是目标相邻。"

[Ability_Dungeon.A_Manticorp_Buffhero H7BaseBuff]
mName="萎缩毒液"
mTooltip=""

[Ability_Dungeon.A_Manticorp_creature_buff H7BaseBuff]
mName="萎缩毒液"
mTooltip=""

[Ability_Dungeon.A_Manticorp_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="蝎尾狮反射"
mTooltip="秘密能力：当英雄拥有20点或更多 %icon_attack 攻击时：\n此生物获得 %stat %icon_health 生命值加成和 %spell1.name 能力。"

[Ability_Dungeon.A_souless_Buffhero H7BaseBuff]
mName="傀儡师"
mTooltip=""

[Ability_Dungeon.A_souless_creature_buff H7BaseBuff]
mName="傀儡师"
mTooltip=""

[Ability_Dungeon.A_souless_creature_buff2 H7BaseBuff]
mName=""
mTooltip=""

[Ability_Dungeon.A_souless_creature_buff_health H7BaseBuff]
mName=""
mTooltip=""

[Ability_Dungeon.A_souless_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="傀儡师"
mTooltip="秘密能力：当英雄拥有20点或更多 %icon_magic 魔力时：\n此生物获得 %stat %icon_health 生命值加成和 %spell1.name 能力，该能力使它在战斗第一回合受到的伤害减少 %res1，然后在第二回合减少 %res2。"

[Ability_Tower.A_t6_creature_buff_morale H7BaseBuff]
mName="勇者牺牲"
mTooltip="此生物的士气 %icon_morale 设置为 %stat。持续 %durnow 回合。"

[Ability_Tower.A_t6_creature_buff_health H7BaseBuff]
mName=""
mTooltip=""

[Ability_Tower.A_t6_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="勇者牺牲"
mTooltip="秘密能力：当英雄拥有 %stat2 点或更多 %icon_defense 防御时：此生物获得 %stat1 %icon_health 生命值加成。\n当此单位至少失去一名生物时，友方'非魔法'型单位的士气将被设置为 %stat2 %icon_Morale。"

[Ability_xel.A_xel_domage_up H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="化学增幅"
mTooltip="秘密能力：当英雄获得20点或更多 %icon_spirit 精神时，此生物获得 %stat1 %icon_health 生命值加成，并且每次造成伤害时，其最终伤害增加 %stat2，持续到其下个回合结束。"

[Ability_xel.A_xel_t3_creature_Buff H7BaseBuff]
mName=""
mTooltip="."

[Ability_xel.A_xel_t3_creature_Buff_seting H7BaseBuff]
mName=""
mTooltip="."

[Ability_xel.A_xel_t3domage_Buffhero H7BaseBuff]
mName=""
mTooltip=""

[Ability_haven.A_wolf_creature_Buff_seting H7BaseBuff]
mName="深度咬伤"
mTooltip="此生物在其最大生命值上获得 %stat %icon_health，持续 %durnow 回合。"

[Ability_haven.A_wolf_creature_Buff H7BaseBuff]
mName=""
mTooltip=""

[Ability_haven.A_wolf_abilty_secrete H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="深度咬伤"
mTooltip="秘密能力：当英雄获得20点或更多 %icon_defense 防御时，此生物获得 %stat1 %icon_health 生命值，并且此生物的首次攻击会对目标施加 %spell1.name。"

[Ability_haven.A_Griffin_buff_health H7BaseBuff]
mName=""
mTooltip=""

[Ability_haven.A_wolf_Buffhero H7BaseBuff]
mName=""
mTooltip=""

[Ability_haven.A_Griffin_abilty_secrete H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狮鹫启迪"
mTooltip="秘密能力：当英雄获得20点或更多 %icon_magic 魔力时，此生物获得 %stat1 %icon_health 生命值加成和 %spell1.name 能力。"

[Ability_haven.A_wolf_buff_health H7BaseBuff]
mName=""
mTooltip=""

[Ability_haven.A_Griffin_abilty_secrete_active H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="狮鹫启迪"
mTooltip="%icon_magic 魔法型生物获得 %stat %icon_moral 士气，并且他们受到的 %icon_light 光明系法术和治疗技能的正向效果提高 %res。持续3回合。"

[Ability_haven.A_Griffin_creature_Buff_seting H7BaseBuff]
mName="狮鹫启迪"
mTooltip="此生物获得 %stat %icon_morale 士气，并且其受到的 %icon_light 光明系法术和治疗技能的正向效果提高 %res，持续 %durnow 回合。"

[Ability_haven.A_Griffin_Buffhero H7BaseBuff]
mName=""
mTooltip=""

[Ability_haven.A_Griffin_creature_Buff H7BaseBuff]
mName=""
mTooltip=""

[Ability_Fortress.A_elementary_secrete_ability H7CreatureAbility]
mName="熔岩护甲"
mTooltip="秘密能力：当英雄拥有 %stat2 点或更多 %icon_spirit 精神时：此生物获得 %stat1 %icon_health 生命值加成。当此单位被攻击时，它对攻击者施加 %spell1.name。"

[Ability_Fortress.A_elementary_creature_buff_burn H7BaseBuff]
mName="元素燃烧"
mTooltip="在此生物回合开始时对其造成 %d %icon_fire 火焰伤害。

[Ability_Inferno.A_t6_inf_secrete_ability H7CreatureAbility]
mName="激励之火"
mTooltip="秘密能力：当英雄拥有 %stat2 点或更多 %icon_attack 攻击时：此生物获得 %stat1 %icon_health 生命值加成。\n攻击：%spell3.name 治疗目标相邻的友方非魔法生物。"

[Ability_Inferno.A_t6_creature_inf_buff_setting H7BaseBuff]
mName="勇者牺牲"
mTooltip="此生物的 %icon_moral 士气为 %stat，持续 %durnow 回合。"

[Ability_Inferno.A_t6_creature_inf_buff_healing H7BaseBuff]
mName="治疗"
mTooltip=""

[Ability_sanctuary.A_Sanctuary_t5_ability H7CreatureAbility]
mName="无缝支援"
mTooltip="秘密能力：当英雄获得20点或更多 %icon_defense 防御时：此生物获得 %stat1 %icon_health 生命值加成，并且 %spell1.name 能力额外赋予友方生物 %stat3 %icon_moral 士气和 %stat4 %icon_defense 防御。"

v1.32

[Ability_Fortress.A_elementary_secrete_ability H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="熔岩护甲"
mTooltip="秘密能力：当英雄拥有 %stat2 点或更多 %icon_spirit 精神时：此生物获得 %stat1 %icon_health 生命值加成。\n当此单位被攻击时，它对攻击者施加 %spell1.name。"

[Ability_Fortress.A_elementary_creature_buff_burn H7BaseBuff]
mName="元素灼烧"
mTooltip="在此生物回合开始时对其造成 %d %icon_fire 火焰伤害。"

v1.33

[Ability_sylvan.A_druid_shoot H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="自然之力"
mTooltip="秘密能力：当英雄获得20点或更多 %icon_spirit 精神时，该生物获得 %buff2.buff.stat %icon_health 生命值，并且可以在每回合使用 %spell1.name，前提是至少使用过一次 %spell3.name。\n每次额外射击消耗英雄50点 %icon_mana 法力。\n如果英雄在战斗回合结束时拥有少于50点 %icon_mana 法力，则无法使用 %spell1.name。"

v1.37

[Ability_sylvan.A_Centaure_Instinct_shoot H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="本能射击"
mTooltip="秘密能力：当英雄获得20点或更多 %icon_attack 攻击时，此生物获得 %spell1.name 技能，该技能赋予生物15%的几率在每次移动时射击敌方单位。"

[Ability_sylvan.A_instinct_attackcreature_Buff H7BaseBuff]
mName="本能射击"
mTooltip="此生物有15%的几率在每次移动时攻击敌方单位。"

[Ability_sylvan.A_instinct_attackcreature_Buff_setting H7BaseBuff]
mName="本能射击"
mTooltip="此生物有15%的几率在每次移动时攻击敌方单位。"